function  zhibiao_M(str,number)
%Çó½â¿ÕÆøÖÊÁ¿·ÖÖ¸Êı
 readlist=load(str);
 X=readlist.gaoya;
 for i=1:number
     y=X(i,3); 
     if  0<=y && y<=50   %¿ÅÁ£
        q=[(50-0)*(y-0)/(50-0)]+0  %¿ÅÁ£
     end  
      if 50<y && y<=150   %¿ÅÁ£
          q=[(100-50)*(y-50)/(150-50)]+50;  %¿ÅÁ£
      end
      if 150<y && y<=250   %¿ÅÁ£
         q=[(150-100)*(y-150)/(250-150)]+100;   %¿ÅÁ£
      end
      if   250<y && y<=350   %¿ÅÁ£
         q=[(200-150)*(y-250)/(350-250)]+150;   %¿ÅÁ£
      end
      if 350<y && y<=420   %¿ÅÁ£
         q=[(300-200)*(y-350)/(420-350)]+200;   %¿ÅÁ£
      end
      if 420<y && y<=500   %¿ÅÁ£
         q=[(400-300)*(y-420)/(500-420)]+300;   %¿Å
      end
      if 500<y && y<=600   %¿ÅÁ£
         q=[(500-400)*(y-500)/(600-500)]+400;   %¿ÅÁ£
     end
     zb(i,3)=q;  
 end
 save('C:\Users\niulimin\Desktop\zhi.mat','zb')
end